#include <stdio.h>
#include <stdlib.h>
#include <time.h>

int main() {
    // Вызываем srand(), чтобы rand() в дальнейшем брал разные начальные значения при каждом запуске программы
    // и возвращал не те же числа, что и при прошлом запуске
    srand(time(NULL));

    int **matrix = NULL;    // Создаем указатель типа int** - указатель на указатели строк матрицы
    int n_rows = 4;
    int n_columns = 4;

    // Динамически выделяем память для n_rows адресов на одномерные массивы, т. е. адресов на строки матрицы
    // В нашем случае в matrix будет 4 таких адреса на одномерные массивы, то есть 4 строки в матрице
    matrix = (int**)malloc(n_rows * sizeof(int*));
    if (matrix == NULL) {   // Проверка успешного выделения памяти
        return EXIT_FAILURE;
    }

    // В каждом указателе на строку выделяем динамически память для n_columns чисел типа int, т. е. для столбцов матрицы
    // В нашем случае, в каждой сроке будет 4 числа, так как n_columns = 4
    for (int i = 0; i < n_rows; i++) {
        *(matrix + i) = (int*)malloc(n_columns * sizeof(int));
        if (*(matrix + i) == NULL) {    // Проверка успешного выделения памяти
            return EXIT_FAILURE;
        }
    }

    // Последовательно разыменовывая указатели, записываем в качестве значений матрицы случайные числа
    // А именно, остаток от деления значения, возвращаемого функцией rand(), на 100
    for (int i = 0; i < n_rows; i++) {
        for (int j = 0; j < n_columns; j++) {
            *(*(matrix + i) + j) = rand() % 100;
        }
    }

    // Вывод значений матрицы, через разыменовывание указателей
    for (int i = 0; i < n_rows; i++) {
        for (int j = 0; j < n_columns; j++) {
            printf("%3d ", *(*(matrix + i) + j));
        }
        printf("\n");
    }

    // Освобождение динамически выделенной памяти
    // Сначала освобождаем память, выделенную в указателях на строки, т. е. указатели типа int*
    // Затем освобождаем сам указатель matrix типа int**
    for (int i = 0; i < n_rows; i++) {
        free(*(matrix + i));
    }
    free(matrix);

    return 0;
}